ИС_СПОРТ_2022/src/Documents/СогласиеНаОбработкуПерсональныхДанных/СогласиеНаОбработкуПерсональныхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СогласиеНаОбработкуПерсональныхДанных</name>
  <basedOn>Document.ЗаявленияНаПриемВСпортивноеУчреждение</basedOn>
  <registerRecords>InformationRegister.СогласияНаОбработкуПерсональныхДанных</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОрганизации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдресОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОбработкуПерсональныхДанных</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИООтветственногоЗаОбработкуПДн</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Субъект</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОСубъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСубъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортныеДанные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СубъектЗаконныйПредставитель</name>
    <type>
      <types>CatalogRef.РодителиЗаконныеПредставителиСпортсменов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОСубъектаЗаконногоПредставителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСубъектаЗаконногоПредставителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортныеДанныеЗаконногоПредставителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/ОтзывСогласияНаОбработкуПерсональныхДанных/ОтзывСогласияНаОбработкуПерсональныхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтзывСогласияНаОбработкуПерсональныхДанных</name>
  <basedOn>Document.СогласиеНаОбработкуПерсональныхДанных</basedOn>
  <registerRecords>InformationRegister.СогласияНаОбработкуПерсональныхДанных</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдресОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОбработкуПерсональныхДанных</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИООтветственногоЗаОбработкуПДн</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Субъект</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтзыва</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/СогласиеНаОбработкуПерсональныхДанных/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "СогласиеНаОбработкуПерсональныхДанных";
	//КомандаПечати.Представление = НСтр("ru = 'Согласие на обработку ПДн'");
	//// {Рарус adilas #13995 -Создать печатную форму согласия на обработку перс данных 2021.03.03
	//КомандаПечати.Идентификатор = "ПФ_MXL_СогласиеПо152ФЗ";
	//КомандаПечати.Представление = НСтр("ru = 'Согласие по 152 ФЗ'");
	// }Рарус adilas #13995 -Создать печатную форму согласия на обработку перс данных 2021.03.03
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// {Рарус adilas #13995 -Создать печатную форму согласия на обработку перс данных 2021.03.03
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СогласиеПо152ФЗ") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_СогласиеПо152ФЗ", НСтр("ru='Согласие по 152 ФЗ'"), СформироватьПечатнуюФормуСогласиеПо152ФЗ(МассивОбъектов, ОбъектыПечати));
	Иначе
		// {Рарус adilas #9913 -Вернуть поддержку БСП 2020.10.12
		ДанныеПечати = ПолучитьДанныеПечати(МассивОбъектов);
		
		ТабДок = Новый ТабличныйДокумент;
		
		ВыборкаОбъектов = ДанныеПечати.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОбъектов.Следующий() Цикл
			Выборка = ВыборкаОбъектов.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.Совершеннолетний Тогда
					Макет = ПолучитьМакет("СогласиеНаОбработкуПерсональныхДанныхСовершеннолетние");
				Иначе
					Макет = ПолучитьМакет("СогласиеНАОбработкуПерсональныхДанных");
				КонецЕсли;
				Область = Макет.ПолучитьОбласть("Согласие");
				Область.Параметры.Заполнить(Выборка);
				ТабДок.Вывести(Область);
			КонецЦикла;
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;	
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СогласиеНАОбработкуПерсональныхДанных", "Согласие на обработку данных", ТабДок);
		// }Рарус adilas #9913 -Вернуть поддержку БСП 2020.10.12
	КонецЕсли;
	
	// }Рарус adilas #13995 -Создать печатную форму согласия на обработку перс данных 2021.03.03
	
		
КонецПроцедуры
// {Рарус adilas #9913 -Вернуть поддержку БСП 2020.10.12
Функция ПолучитьДанныеПечати(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов",МассивОбъектов);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СогласиеНаОбработкуПерсональныхДанных.ФИОСубъектаЗаконногоПредставителя КАК ФИОРодителя,
	               |	СогласиеНаОбработкуПерсональныхДанных.ПаспортныеДанныеЗаконногоПредставителя КАК ДокументРодителя,
	               |	СогласиеНаОбработкуПерсональныхДанных.АдресСубъектаЗаконногоПредставителя КАК АдресРегистрации2,
	               |	СогласиеНаОбработкуПерсональныхДанных.АдресСубъектаЗаконногоПредставителя КАК АдресПроживания,
	               |	СогласиеНаОбработкуПерсональныхДанных.Субъект КАК ФИОСпортсмена,
	               |	СогласиеНаОбработкуПерсональныхДанных.ПаспортныеДанные КАК ДокументСпортсмена,
	               |	ВЫБОР
	               |		КОГДА РАЗНОСТЬДАТ(СогласиеНаОбработкуПерсональныхДанных.Субъект.ФизическоеЛицо.ДатаРождения, СогласиеНаОбработкуПерсональныхДанных.Дата, ГОД) >= 18
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Совершеннолетний,
	               |	СогласиеНаОбработкуПерсональныхДанных.Ссылка КАК Ссылка,
	               |	СогласиеНаОбработкуПерсональныхДанных.ДатаПолучения КАК Дата
	               |ИЗ
	               |	Документ.СогласиеНаОбработкуПерсональныхДанных КАК СогласиеНаОбработкуПерсональныхДанных
	               |ГДЕ
	               |	СогласиеНаОбработкуПерсональныхДанных.Ссылка В(&МассивОбъектов)
	               |ИТОГИ ПО
	               |	Ссылка";
	Возврат Запрос.Выполнить();
	
КонецФункции	
// }Рарус adilas #9913 -Вернуть поддержку БСП 2020.10.12
// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
//  Параметры                  - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Документы.ОтзывСогласияНаОбработкуПерсональныхДанных.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
//  Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
// 
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Возврат СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(КомандыСозданияНаОсновании, Метаданные.Документы.СогласиеНаОбработкуПерсональныхДанных);
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// {Рарус adilas #13995 -Создать печатную форму согласия на обработку перс данных 2021.03.03
Функция СформироватьПечатнуюФормуСогласиеПо152ФЗ(МассивОбъектовДляПечати, ОбъектыПечати)
	
	Если ТипЗнч(МассивОбъектовДляПечати) = Тип("Массив") Тогда
		
		МассивОбъектов = МассивОбъектовДляПечати;
		
	Иначе
		
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(МассивОбъектовДляПечати);
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СогласиеНаОбработкуПерсональныхДанных.Ссылка КАК Документ,
		|	СогласиеНаОбработкуПерсональныхДанных.Дата КАК Дата,
		|	СогласиеНаОбработкуПерсональныхДанных.НаименованиеОрганизации КАК НаименованиеОрганизации,
		|	СогласиеНаОбработкуПерсональныхДанных.ЮридическийАдресОрганизации КАК ЮридическийАдресОрганизации,
		|	СогласиеНаОбработкуПерсональныхДанных.Субъект КАК Субъект,
		|	СогласиеНаОбработкуПерсональныхДанных.ФИОСубъекта КАК ФИОСубъекта,
		|	СогласиеНаОбработкуПерсональныхДанных.АдресСубъекта КАК АдресСубъекта,
		|	СогласиеНаОбработкуПерсональныхДанных.ПаспортныеДанные КАК ПаспортныеДанные,
		|	СогласиеНаОбработкуПерсональныхДанных.СубъектЗаконныйПредставитель КАК СубъектЗаконныйПредставитель,
		|	СогласиеНаОбработкуПерсональныхДанных.ФИОСубъектаЗаконногоПредставителя КАК ФИОСубъектаЗаконногоПредставителя
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	Документ.СогласиеНаОбработкуПерсональныхДанных КАК СогласиеНаОбработкуПерсональныхДанных
		|ГДЕ
		|	СогласиеНаОбработкуПерсональныхДанных.Ссылка В(&МассивОбъектов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Данные.Документ КАК Документ,
		|	ВТ_Данные.Дата КАК Дата,
		|	ВТ_Данные.НаименованиеОрганизации КАК НаименованиеОрганизации,
		|	ВТ_Данные.ЮридическийАдресОрганизации КАК ЮридическийАдресОрганизации,
		|	ВТ_Данные.Субъект КАК Субъект,
		|	ВТ_Данные.ФИОСубъекта КАК ФИОСубъекта,
		|	ВТ_Данные.АдресСубъекта КАК АдресСубъекта,
		|	ВТ_Данные.ПаспортныеДанные КАК ПаспортныеДанные,
		|	ВТ_Данные.СубъектЗаконныйПредставитель КАК СубъектЗаконныйПредставитель,
		|	ВТ_Данные.ФИОСубъектаЗаконногоПредставителя КАК ФИОСубъектаЗаконногоПредставителя
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|ИТОГИ ПО
		|	Документ";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	ПутьКМакету = "Документ.СогласиеНаОбработкуПерсональныхДанных.ПФ_MXL_СогласиеПо152ФЗ";
	Макет = УправлениеПечатью.МакетПечатнойФормы(ПутьКМакету); // Получаем макет
	
	ТабДок = Новый ТабличныйДокумент;  // Создаем новый ТабДок
	
	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСсылка.Следующий() Цикл
			// Вставить обработку выборки ВыборкаСсылка
			ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка"); // Получаем области из макета
			ОбластьШапка.Параметры.ФИОСубъекта = ВыборкаСсылка.Ссылка.ТренерСборной;
			ТабДок.Вывести(ОбластьШапка);
			
			ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать(); 
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Спортсмен) Тогда
					
				Иначе
					ОбщегоНазначения.СообщитьПользователю("Состав группы пустой!");
				КонецЕсли;
			КонецЦикла;
		
			// Подвал
			ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
			ТабДок.Вывести(ОбластьПодвал);
			
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;
	КонецЕсли;
	
	ТабДок.КлючПараметровПечати	= ПутьКМакету;
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб 			= Истина;
	
	Возврат ТабДок;
	
КонецФункции

// }Рарус adilas #13995 -Создать печатную форму согласия на обработку перс данных 2021.03.03

#КонецОбласти

#КонецОбласти

#КонецЕсли
